Sales data analysis project1

Example:1
Skills: GroupBy, time-series, filtering
What to analyze:

Monthly/quarterly sales

Best-selling products

Sales trends by region or product category

In [1]:
import pandas as pd
import numpy as np

In [2]:
sales=pd.read_excel(r"C:\Users\Admin\Desktop\python\Minskole class of data analytics\pandas\practise datasets\project1 sales data analysis.xlsx")
sales

   OrderID        Date Region Product  Quantity  UnitPrice
0      101  2024-01-01   East       A        10         20
1      102  2024-01-02   West       B         5         30
2      103  2024-01-02   East       A         8         20
3      104  2024-01-03  South       C        12         25
4      105  2024-01-03   East       B         7         30

In [4]:
sales.groupby("Product")["Quantity"].count()

Product
A    2
B    2
C    1
Name: Quantity, dtype: int64

calculate total sales for each product

In [5]:
sales.groupby("Product")["UnitPrice"].sum()

Product
A    40
B    60
C    25
Name: UnitPrice, dtype: int64

In [6]:
sales.groupby("Date")["UnitPrice"].count()

Date
2024-01-01    1
2024-01-02    2
2024-01-03    2
Name: UnitPrice, dtype: int64

Total sale done

In [7]:
sales['TotalSales'] = sales['Quantity'] * sales['UnitPrice']

In [8]:
sales

   OrderID        Date Region Product  Quantity  UnitPrice  TotalSales
0      101  2024-01-01   East       A        10         20         200
1      102  2024-01-02   West       B         5         30         150
2      103  2024-01-02   East       A         8         20         160
3      104  2024-01-03  South       C        12         25         300
4      105  2024-01-03   East       B         7         30         210

Total sales by region

In [9]:
region_sales = sales.groupby('Region')['TotalSales'].sum().reset_index()
print(region_sales)

  Region  TotalSales
0   East         570
1  South         300
2   West         150

 Project 2: HR Employee Data Analysis

 Skills: Data filtering, statistical summaries
What to analyze:

Attrition rate by department, age, experience

Average salary by job role

Employee tenure trends

In [12]:
hr_result=pd.read_excel(r"C:\Users\Admin\Desktop\python\Minskole class of data analytics\pandas\practise datasets\project1 sales data analysis.xlsx",sheet_name="HRData")
hr_result

   EmployeeID     Name Department  Salary Attrition
0           1    Alice         HR   50000        No
1           2      Bob    Finance   60000       Yes
2           3  Charlie         IT   55000        No
3           4    David         IT   58000       Yes
4           5      Eva         HR   52000        No

 Step 2: Count of Employees per Department

In [14]:
hr_result["Department"].value_counts().reset_index()

  Department  count
0         HR      2
1         IT      2
2    Finance      1

Average Salary by Department

In [15]:
avg_salary=hr_result.groupby("Department")["Salary"].mean().reset_index()
avg_salary

  Department   Salary
0    Finance  60000.0
1         HR  51000.0
2         IT  56500.0

ðŸ”¹ Step 4: Attrition Count

In [16]:
attri_count=hr_result["Attrition"].value_counts().reset_index()
attri_count

  Attrition  count
0        No      3
1       Yes      2

Project 3: Student Performance Analysis

Skills: Grouping, conditional filtering
What to analyze:

Average scores by subject and class

Top students in each subject

Failing vs. passing rate

In [17]:
stud_performance=pd.read_excel(r"C:\Users\Admin\Desktop\python\Minskole class of data analytics\pandas\practise datasets\project1 sales data analysis.xlsx",sheet_name="StudentData")
stud_performance

   StudentID  Name  Math  Science  English Class
0        101  John    85       92       78   10A
1        102  Sara    78       81       74   10B
2        103  Mike    90       87       82   10A
3        104  Nina    88       85       80   10B
4        105  Liam    76       79       75   10A

ðŸ”¹ Step 2: Average Score of Each Student

In [26]:
stud_performance["avg"]=stud_performance[["Math","Science","English"]].mean(axis=1)
print(stud_performance[["Name","avg"]])

   Name        avg
0  John  85.000000
1  Sara  77.666667
2  Mike  86.333333
3  Nina  84.333333
4  Liam  76.666667

In [ ]:
stud_performance.groupby("Name")["Math"].max().reset_index()

   Name  Math
0  John    85
1  Liam    76
2  Mike    90
3  Nina    88
4  Sara    78

ðŸ”¹ Step 3: Class-wise Average for Each Subject

In [29]:
class_avg=stud_performance.groupby("Class")[["Math","Science","English"]].mean().reset_index()
class_avg

  Class       Math  Science    English
0   10A  83.666667     86.0  78.333333
1   10B  83.000000     83.0  77.000000

 Top Student Based on Average Score

In [31]:
top_student=stud_performance.loc[stud_performance['avg'].idxmax()]
print(top_student[['Name', 'avg']])

Name         Mike
avg     86.333333
Name: 2, dtype: object

project3: IT Support Ticket Analysis
Skills: GroupBy, text preprocessing (basic)
What to analyze:

Tickets per category or department

Avg. resolution time

Trends in open vs. closed tickets

In [32]:
IT_support=pd.read_excel(r"C:\Users\Admin\Desktop\python\Minskole class of data analytics\pandas\practise datasets\it_support_ticket_analysis.xlsx")
IT_support

   TicketID Department  Category  Status Priority CreatedDate ResolvedDate
0         1         HR     Login  Closed     High  2024-01-01   2024-01-02
1         2    Finance  Software    Open   Medium  2024-01-03          NaN
2         3         IT   Network  Closed     High  2024-01-04   2024-01-05
3         4         HR  Hardware  Closed      Low  2024-01-05   2024-01-06
4         5         IT     Login    Open     High  2024-01-07          NaN
5         6    Finance  Software  Closed      Low  2024-01-08   2024-01-09
6         7         HR   Network    Open   Medium  2024-01-10          NaN

Tickets Count by Department

In [33]:
Tickets_Count=IT_support.groupby("Department").value_counts().reset_index()
Tickets_Count

,Department,TicketID,Category,Status,Priority,CreatedDate,ResolvedDate,count
0,Finance,6,Software,Closed,Low,2024-01-08,2024-01-09,1
1,HR,1,Login,Closed,High,2024-01-01,2024-01-02,1
2,HR,4,Hardware,Closed,Low,2024-01-05,2024-01-06,1
3,IT,3,Network,Closed,High,2024-01-04,2024-01-05,1